{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 4,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 39,
      "content": "[C]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 47,
      "content": "[=C]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 53,
      "content": "[Branch1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 54,
      "content": "[Ring1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 57,
      "content": "[=Branch1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 59,
      "content": "[O]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 61,
      "content": "[Branch2]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 62,
      "content": "[Ring2]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 65,
      "content": "[F]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 67,
      "content": "[P]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 68,
      "content": "[N]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 69,
      "content": "[=Branch2]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 71,
      "content": "[#Branch2]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 72,
      "content": "[#Branch1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 73,
      "content": "[=N]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 74,
      "content": "[S]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 76,
      "content": "[=O]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 77,
      "content": "[#C]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 79,
      "content": "[Si]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 81,
      "content": "[Cl]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 85,
      "content": "[/C]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 86,
      "content": "[#N]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 88,
      "content": "[B]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 91,
      "content": "[C@H1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 92,
      "content": "[=Ring1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 97,
      "content": "[C@@H1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 98,
      "content": "[Br]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 99,
      "content": "[NH1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 101,
      "content": "[/Br]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 102,
      "content": "[/N]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 103,
      "content": "[=N+1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 104,
      "content": "[=P]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 105,
      "content": "[=Ring2]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 106,
      "content": "[=S]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 107,
      "content": "[Branch3]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 108,
      "content": "[C-1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 109,
      "content": "[C@@]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 110,
      "content": "[C@]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 111,
      "content": "[Fe]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 112,
      "content": "[H]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 113,
      "content": "[I]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 114,
      "content": "[N+1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 115,
      "content": "[O-1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 116,
      "content": "[P+1]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 117,
      "content": "[Se]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 118,
      "content": "[Sn]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 119,
      "content": "[\\C]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\[[^\\]]+\\]"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          0
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          1
        ],
        "tokens": [
          "[EOS]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "[SEP]": 2,
      "[CLS]": 3,
      "[PAD]": 4,
      "[MASK]": 5,
      "[UNK]": 6,
      "\n": 7,
      "#": 8,
      "+": 9,
      "-": 10,
      "/": 11,
      "1": 12,
      "2": 13,
      "=": 14,
      "@": 15,
      "B": 16,
      "C": 17,
      "F": 18,
      "H": 19,
      "I": 20,
      "N": 21,
      "O": 22,
      "P": 23,
      "R": 24,
      "S": 25,
      "[": 26,
      "\\": 27,
      "]": 28,
      "a": 29,
      "c": 30,
      "e": 31,
      "g": 32,
      "h": 33,
      "i": 34,
      "l": 35,
      "n": 36,
      "r": 37,
      "C]": 38,
      "[C]": 39,
      "[=": 40,
      "1]": 41,
      "Br": 42,
      "an": 43,
      "ch": 44,
      "Bran": 45,
      "Branch": 46,
      "[=C]": 47,
      "Branch1]": 48,
      "Ri": 49,
      "ng": 50,
      "Ring": 51,
      "[Ring": 52,
      "[Branch1]": 53,
      "[Ring1]": 54,
      "2]": 55,
      "Branch2]": 56,
      "[=Branch1]": 57,
      "O]": 58,
      "[O]": 59,
      "N]": 60,
      "[Branch2]": 61,
      "[Ring2]": 62,
      "[#": 63,
      "[F": 64,
      "[F]": 65,
      "[P": 66,
      "[P]": 67,
      "[N]": 68,
      "[=Branch2]": 69,
      "[S": 70,
      "[#Branch2]": 71,
      "[#Branch1]": 72,
      "[=N]": 73,
      "[S]": 74,
      "[C": 75,
      "[=O]": 76,
      "[#C]": 77,
      "i]": 78,
      "[Si]": 79,
      "l]": 80,
      "[Cl]": 81,
      "H1]": 82,
      "[C@": 83,
      "[/": 84,
      "[/C]": 85,
      "[#N]": 86,
      "B]": 87,
      "[B]": 88,
      "[N": 89,
      "[=Ring": 90,
      "[C@H1]": 91,
      "[=Ring1]": 92,
      "[C@@": 93,
      "+1]": 94,
      "-1]": 95,
      "Br]": 96,
      "[C@@H1]": 97,
      "[Br]": 98,
      "[NH1]": 99,
      "n]": 100
    },
    "merges": [
      [
        "C",
        "]"
      ],
      [
        "[",
        "C]"
      ],
      [
        "[",
        "="
      ],
      [
        "1",
        "]"
      ],
      [
        "B",
        "r"
      ],
      [
        "a",
        "n"
      ],
      [
        "c",
        "h"
      ],
      [
        "Br",
        "an"
      ],
      [
        "Bran",
        "ch"
      ],
      [
        "[=",
        "C]"
      ],
      [
        "Branch",
        "1]"
      ],
      [
        "R",
        "i"
      ],
      [
        "n",
        "g"
      ],
      [
        "Ri",
        "ng"
      ],
      [
        "[",
        "Ring"
      ],
      [
        "[",
        "Branch1]"
      ],
      [
        "[Ring",
        "1]"
      ],
      [
        "2",
        "]"
      ],
      [
        "Branch",
        "2]"
      ],
      [
        "[=",
        "Branch1]"
      ],
      [
        "O",
        "]"
      ],
      [
        "[",
        "O]"
      ],
      [
        "N",
        "]"
      ],
      [
        "[",
        "Branch2]"
      ],
      [
        "[Ring",
        "2]"
      ],
      [
        "[",
        "#"
      ],
      [
        "[",
        "F"
      ],
      [
        "[F",
        "]"
      ],
      [
        "[",
        "P"
      ],
      [
        "[P",
        "]"
      ],
      [
        "[",
        "N]"
      ],
      [
        "[=",
        "Branch2]"
      ],
      [
        "[",
        "S"
      ],
      [
        "[#",
        "Branch2]"
      ],
      [
        "[#",
        "Branch1]"
      ],
      [
        "[=",
        "N]"
      ],
      [
        "[S",
        "]"
      ],
      [
        "[",
        "C"
      ],
      [
        "[=",
        "O]"
      ],
      [
        "[#",
        "C]"
      ],
      [
        "i",
        "]"
      ],
      [
        "[S",
        "i]"
      ],
      [
        "l",
        "]"
      ],
      [
        "[C",
        "l]"
      ],
      [
        "H",
        "1]"
      ],
      [
        "[C",
        "@"
      ],
      [
        "[",
        "/"
      ],
      [
        "[/",
        "C]"
      ],
      [
        "[#",
        "N]"
      ],
      [
        "B",
        "]"
      ],
      [
        "[",
        "B]"
      ],
      [
        "[",
        "N"
      ],
      [
        "[=",
        "Ring"
      ],
      [
        "[C@",
        "H1]"
      ],
      [
        "[=Ring",
        "1]"
      ],
      [
        "[C@",
        "@"
      ],
      [
        "+",
        "1]"
      ],
      [
        "-",
        "1]"
      ],
      [
        "Br",
        "]"
      ],
      [
        "[C@@",
        "H1]"
      ],
      [
        "[",
        "Br]"
      ],
      [
        "[N",
        "H1]"
      ],
      [
        "n",
        "]"
      ]
    ]
  }
}