{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "[SEP]": 2,
      "[CLS]": 3,
      "[PAD]": 4,
      "[MASK]": 5,
      "[UNK]": 6,
      "[O-1]": 7,
      "[=N]": 8,
      "[#C]": 9,
      "[=O]": 10,
      "[O]": 11,
      "[P+1]": 12,
      "[Branch2]": 13,
      "[Cl]": 14,
      "[Ring2]": 15,
      "[Se]": 16,
      "[=S]": 17,
      "[Si]": 18,
      "[/Br]": 19,
      "[=P]": 20,
      "[I]": 21,
      "[S]": 22,
      "[C@]": 23,
      "[C-1]": 24,
      "[=Ring1]": 25,
      "[C@H1]": 26,
      "[N]": 27,
      "[NH1]": 28,
      "[Br]": 29,
      "[\\C]": 30,
      "[H]": 31,
      "[C]": 32,
      "[Branch1]": 33,
      "[#Branch1]": 34,
      "[=Branch2]": 35,
      "[B]": 36,
      "[/C]": 37,
      "[Ring1]": 38,
      "[=Branch1]": 39,
      "[#N]": 40,
      "[/N]": 41,
      "[N+1]": 42,
      "[C@@]": 43,
      "[C@@H1]": 44,
      "[#Branch2]": 45,
      "[F]": 46,
      "[=C]": 47,
      "[Sn]": 48,
      "[Fe]": 49,
      "[P]": 50
    },
    "unk_token": "[UNK]"
  }
}