{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "[SEP]": 2,
      "[CLS]": 3,
      "[PAD]": 4,
      "[MASK]": 5,
      "[UNK]": 6,
      "[=Branch1]": 7,
      "[=N]": 8,
      "[O]": 9,
      "[Branch1]": 10,
      "[#C]": 11,
      "[P]": 12,
      "[C]": 13,
      "[=C]": 14,
      "[Ring1]": 15,
      "[N]": 16,
      "[/C]": 17,
      "[Ring2]": 18,
      "[Branch2]": 19,
      "[#Branch1]": 20,
      "[#Branch2]": 21,
      "[F]": 22,
      "[=Branch2]": 23
    },
    "unk_token": "[UNK]"
  }
}