{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[BOS]": 0,
      "[EOS]": 1,
      "[SEP]": 2,
      "[CLS]": 3,
      "[PAD]": 4,
      "[MASK]": 5,
      "[UNK]": 6,
      "[C]": 7,
      "[N+1]": 8,
      "[H]": 9,
      "[O-1]": 10,
      "[C-1]": 11,
      "[=N]": 12,
      "[Branch1]": 13,
      "[/N]": 14,
      "[O]": 15,
      "[NH1]": 16,
      "[Br]": 17,
      "[=Ring1]": 18,
      "[=O]": 19,
      "[=Ring2]": 20,
      "[N]": 21,
      "[Si]": 22,
      "[/Br]": 23,
      "[Fe]": 24,
      "[C@H1]": 25,
      "[Cl]": 26,
      "[Branch2]": 27,
      "[Ring1]": 28,
      "[F]": 29,
      "[Branch3]": 30,
      "[=P]": 31,
      "[/C]": 32,
      "[C@@]": 33,
      "[I]": 34,
      "[C@@H1]": 35,
      "[#C]": 36,
      "[P+1]": 37,
      "[=C]": 38,
      "[\\C]": 39,
      "[=S]": 40,
      "[S]": 41,
      "[#Branch2]": 42,
      "[=Branch1]": 43,
      "[#Branch1]": 44,
      "[Se]": 45,
      "[Ring2]": 46,
      "[=N+1]": 47,
      "[=Branch2]": 48,
      "[Sn]": 49,
      "[C@]": 50,
      "[P]": 51,
      "[#N]": 52,
      "[B]": 53
    },
    "unk_token": "[UNK]"
  }
}